Examinator/src/InformationRegisters/ВыданныеПинКодыСУО/ВыданныеПинКодыСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВыданныеПинКодыСУО</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Заблокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Выдан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомлениеПоказано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сообщение</name>
    <type>
      <types>DocumentRef.СообщениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИспользования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоказаУведомления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Выдавший</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Заблокировал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаБлокировки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Опция</name>
    <type>
      <types>CatalogRef.ОпцииСерииПинКодовСУО</types>
    </type>
  </attributes>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииПинКодовСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Код</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ВремяДоступаПользователейСУО/ВремяДоступаПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВремяДоступаПользователейСУО</name>
  <attributes>
    <name>ДатаНачалаДоступа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДоступа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ВидыПинКодовСУО/ВидыПинКодовСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПинКодовСУО</name>
  <enumValues>
    <name>Цифры</name>
  </enumValues>
  <enumValues>
    <name>ЦифрыИАнглийскиеБуквы</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/СерииПинКодовСУО/СерииПинКодовСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СерииПинКодовСУО</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДлинаКода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Уведомление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.ВидыПинКодовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонРассылки</name>
    <type>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>АутентификацияВебКабинета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АутентификацияСтандартная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АутентификацияOpenID</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстановитьНастройкиАутентификации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьДоступаВДнях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОпций</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПродолжительностьДоступаВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ГруппыДоступа</name>
    <attributes>
      <name>ГруппаДоступа</name>
      <type>
        <types>CatalogRef.ГруппыДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.ОпцииСерииПинКодовСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Обучение</name>
    <attributes>
      <name>Проведение</name>
      <type>
        <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
        <types>DocumentRef.ПроведениеОбученияСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.ОпцииСерииПинКодовСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УчебныеГруппы</name>
    <attributes>
      <name>УчебнаяГруппа</name>
      <type>
        <types>CatalogRef.УчебныеГруппыСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.ОпцииСерииПинКодовСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГруппыПользователей</name>
    <attributes>
      <name>ГруппаПользователей</name>
      <type>
        <types>CatalogRef.ГруппыПользователей</types>
      </type>
    </attributes>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.ОпцииСерииПинКодовСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазделыФорума</name>
    <attributes>
      <name>РазделФорума</name>
      <type>
        <types>CatalogRef.РазделыФорумаСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.ОпцииСерииПинКодовСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазделыБиблиотеки</name>
    <attributes>
      <name>РазделБиблиотеки</name>
      <type>
        <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.ОпцииСерииПинКодовСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Новости</name>
    <attributes>
      <name>Новость</name>
      <type>
        <types>DocumentRef.НовостьСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.ОпцииСерииПинКодовСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Рассылка</name>
    <attributes>
      <name>ЭлектронныйАдрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отправлено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоЭлементаСправочникаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/InformationRegisters/ВыданныеПинКодыСУО/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// ЗАПИСЬ

Процедура СоздатьКодыСерии(Знач Серия, Знач Количество, Знач Длина=Неопределено, Знач Вид=Неопределено) Экспорт
	
	// Делаем проверки
	
	Если Количество < 1 Тогда
		Количество = 1;
	КонецЕсли;
	
	Если Длина = Неопределено ИЛИ Вид=Неопределено Тогда
		
		ДанныеСерии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Серия, "ДлинаКода, Вид");
		
		Если Длина = Неопределено Тогда
			Длина = ДанныеСерии.ДлинаКода;	
		КонецЕсли;
		
		Если Вид = Неопределено Тогда
			Вид = ДанныеСерии.Вид;	
		КонецЕсли;		
		
	КонецЕсли;
	
	// Записываем коды
	
	НаборЗаписей = РегистрыСведений.ВыданныеПинКодыСУО.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Серия.Установить(Серия);

	НаборЗаписей.Прочитать();
	
	МассивКодов   = НаборЗаписей.ВыгрузитьКолонку("Код");
	ТекущаяДата   = ТекущаяДатаСеанса();
	Ответственный = Пользователи.ТекущийПользователь();
	
	КоличествоНовыхКодов = 0;
	Генератор = Новый ГенераторСлучайныхЧисел;
	
	Для НомерНовогоКода = 1 По Количество Цикл
		
		НовыйКод = НовыйУникальныйКод(Длина, Вид, МассивКодов,, Генератор);
		
		МассивКодов.Добавить(НовыйКод);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.Серия = Серия;
		НоваяЗапись.Код = НовыйКод;
		НоваяЗапись.ДатаСоздания = ТекущаяДата;
		НоваяЗапись.Ответственный = Ответственный;
		
	КонецЦикла; 
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура АктивироватьКод(Знач Серия, Знач Код, Знач Пользователь, Знач ДатаИспользования=Неопределено, Знач Опция=Неопределено, Знач ОбновитьДанныеВебКабинета=Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	// Получаем переменные
	
	Если ДатаИспользования = Неопределено Тогда
		ДатаИспользования = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Опция)		
		И Справочники.СерииПинКодовСУО.ЕстьОпции(Серия) Тогда
		
		ВызватьИсключение НСтр("ru = 'Вариант для выбора пин-кода не указан'");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Опция)
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Опция, "Владелец") <> Серия Тогда
		
		ВызватьИсключение НСтр("ru = 'Вариант выбора пин-кода не соответствует вариантам выбора, указанным в настройках серии пин-кодов'");
		
	КонецЕсли;
	
	// Фиксируем факт использования пин-кода
	
	НаборЗаписей = РегистрыСведений.ВыданныеПинКодыСУО.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Серия.Установить(Серия);
	НаборЗаписей.Отбор.Код.Установить(Код);

	НаборЗаписей.Прочитать();

	Если НаборЗаписей.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Пин-код не найден'");
	КонецЕсли;
	
	Запись = НаборЗаписей[0];
	
	Если Запись.Заблокирован Тогда
		ВызватьИсключение НСтр("ru = 'Пин-код заблокирован'");
	КонецЕсли;
	
	Запись.Пользователь = Пользователь;
	Запись.ДатаИспользования = ДатаИспользования;
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Серия, "Уведомление"))) Тогда
		Запись.УведомлениеПоказано = Истина; // Так как уведомление пустое
	КонецЕсли;
	
	Запись.Опция = Опция;
	
	НаборЗаписей.Записать();
	
	// Добавляем пользователя в группу доступа
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СерииПинКодовСУОГруппыДоступа.ГруппаДоступа КАК ГруппаДоступа
		|ИЗ
		|	Справочник.СерииПинКодовСУО.ГруппыДоступа КАК СерииПинКодовСУОГруппыДоступа
		|ГДЕ
		|	СерииПинКодовСУОГруппыДоступа.Ссылка = &Серия
		|	И (СерииПинКодовСУОГруппыДоступа.Опция = &Опция
		|			ИЛИ СерииПинКодовСУОГруппыДоступа.Опция = ЗНАЧЕНИЕ(Справочник.ОпцииСерииПинКодовСУО.ПустаяСсылка))";
	
	Запрос.УстановитьПараметр("Серия", Серия);	
	Запрос.УстановитьПараметр("Опция", Опция);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		ГруппаДоступаОбъект = ВыборкаДетальныеЗаписи.ГруппаДоступа.ПолучитьОбъект();
				
		Если ГруппаДоступаОбъект.Пользователи.Найти(Пользователь, "Пользователь") = Неопределено Тогда
			ГруппаДоступаОбъект.Пользователи.Добавить().Пользователь = Пользователь;
		КонецЕсли;
		
		ГруппаДоступаОбъект.Записать();		
		
	КонецЦикла;
	
	// Устанавливаем настройки аутентификации
	
	ДанныеСерии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Серия, "УстановитьНастройкиАутентификации, АутентификацияOpenID, АутентификацияСтандартная, АутентификацияВебКабинета");
	ЭтоПолноправныйПользователь = Пользователи.ЭтоПолноправныйПользователь(Пользователь);
	
	Если ДанныеСерии.УстановитьНастройкиАутентификации И НЕ ЭтоПолноправныйПользователь Тогда
		
		ПользовательОбъект = Пользователь.ПолучитьОбъект();		
		
		ОписаниеПользователяИБ = Новый Структура;
		ОписаниеПользователяИБ.Вставить("Действие", "Записать");
		ОписаниеПользователяИБ.Вставить("АутентификацияВебКабинета", ДанныеСерии.АутентификацияВебКабинета);
		ОписаниеПользователяИБ.Вставить("АутентификацияOpenID", ДанныеСерии.АутентификацияOpenID);
		ОписаниеПользователяИБ.Вставить("АутентификацияСтандартная", ДанныеСерии.АутентификацияСтандартная);
		
		ПользовательОбъект.ДополнительныеСвойства.Вставить(
			"ОписаниеПользователяИБ", ОписаниеПользователяИБ);	
		
		ПользовательОбъект.ДополнительныеСвойства.Вставить("АутентификацияВебКабинета", ДанныеСерии.АутентификацияВебКабинета);
		
		ПользовательОбъект.Записать();
		
	КонецЕсли;
	
	// Продолжительность
	
	Если НЕ ЭтоПолноправныйПользователь И ПолучитьФункциональнуюОпцию("ИспользоватьОграниченияВремениДоступаКПрограммеСУО") Тогда
		
		ДатаНачалаДоступа = ТекущаяДатаСеанса();
		ПродолжительностьДоступа = Справочники.СерииПинКодовСУО.ПродолжительностьДоступаВСекундах(Серия);
		
		Если ПродолжительностьДоступа > 0 Тогда
			РегистрыСведений.ВремяДоступаПользователейСУО.УстановитьВремяДоступа(Пользователь, ДатаНачалаДоступа, ДатаНачалаДоступа + ПродолжительностьДоступа);
		КонецЕсли;
		
	КонецЕсли;
	
	// Организаторы
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОрганизаторыСерии.Организатор КАК Организатор
		|ИЗ
		|	Справочник.СерииПинКодовСУО.Организаторы КАК ОрганизаторыСерии
		|ГДЕ
		|	ОрганизаторыСерии.Ссылка = &Серия";
	
	Запрос.УстановитьПараметр("Серия", Серия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ОрганизаторОбъект = ВыборкаДетальныеЗаписи.Организатор.ПолучитьОбъект();
				
		Если ОрганизаторОбъект.Видимость.Найти(Пользователь, "Пользователь") = Неопределено Тогда
			ОрганизаторОбъект.Видимость.Добавить().Пользователь = Пользователь;
		КонецЕсли;
		
		ОрганизаторОбъект.Записать();				
		
	КонецЦикла;		
	
	// Добавляем в учебные группы
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СерииПинКодовСУОУчебныеГруппы.УчебнаяГруппа КАК УчебнаяГруппа
		|ИЗ
		|	Справочник.СерииПинКодовСУО.УчебныеГруппы КАК СерииПинКодовСУОУчебныеГруппы
		|ГДЕ
		|	СерииПинКодовСУОУчебныеГруппы.Ссылка = &Серия
		|	И (СерииПинКодовСУОУчебныеГруппы.Опция = &Опция
		|			ИЛИ СерииПинКодовСУОУчебныеГруппы.Опция = ЗНАЧЕНИЕ(Справочник.ОпцииСерииПинКодовСУО.ПустаяСсылка))";
	
	Запрос.УстановитьПараметр("Серия", Серия);
	Запрос.УстановитьПараметр("Опция", Опция);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		УчебнаяГруппаОбъект = ВыборкаДетальныеЗаписи.УчебнаяГруппа.ПолучитьОбъект();
				
		Если УчебнаяГруппаОбъект.Состав.Найти(Пользователь, "Пользователь") = Неопределено Тогда
			УчебнаяГруппаОбъект.Состав.Добавить().Пользователь = Пользователь;
		КонецЕсли;
		
		УчебнаяГруппаОбъект.Записать();				
		
	КонецЦикла;

	// Группы пользователей
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СерииПинКодовСУОГруппыПользователей.ГруппаПользователей КАК ГруппаПользователей
		|ИЗ
		|	Справочник.СерииПинКодовСУО.ГруппыПользователей КАК СерииПинКодовСУОГруппыПользователей
		|ГДЕ
		|	СерииПинКодовСУОГруппыПользователей.Ссылка = &Серия
		|	И (СерииПинКодовСУОГруппыПользователей.Опция = &Опция
		|			ИЛИ СерииПинКодовСУОГруппыПользователей.Опция = ЗНАЧЕНИЕ(Справочник.ОпцииСерииПинКодовСУО.ПустаяСсылка))";
	
	Запрос.УстановитьПараметр("Серия", Серия);
	Запрос.УстановитьПараметр("Опция", Опция);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ГруппаПользователейОбъект = ВыборкаДетальныеЗаписи.ГруппаПользователей.ПолучитьОбъект();
				
		Если ГруппаПользователейОбъект.Состав.Найти(Пользователь, "Пользователь") = Неопределено Тогда
			ГруппаПользователейОбъект.Состав.Добавить().Пользователь = Пользователь;
		КонецЕсли;
		
		ГруппаПользователейОбъект.Записать();			
		
	КонецЦикла;
	
	// Раздел форума
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СерииПинКодовСУОРазделыФорума.РазделФорума КАК РазделФорума
		|ИЗ
		|	Справочник.СерииПинКодовСУО.РазделыФорума КАК СерииПинКодовСУОРазделыФорума
		|ГДЕ
		|	СерииПинКодовСУОРазделыФорума.Ссылка = &Серия
		|	И (СерииПинКодовСУОРазделыФорума.Опция = &Опция
		|			ИЛИ СерииПинКодовСУОРазделыФорума.Опция = ЗНАЧЕНИЕ(Справочник.ОпцииСерииПинКодовСУО.ПустаяСсылка))";
	
	Запрос.УстановитьПараметр("Серия", Серия);
	Запрос.УстановитьПараметр("Опция", Опция);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		РазделФорумаОбъект = ВыборкаДетальныеЗаписи.РазделФорума.ПолучитьОбъект();
				
		Если РазделФорумаОбъект.Видимость.Найти(Пользователь, "Пользователь") = Неопределено Тогда
			РазделФорумаОбъект.Видимость.Добавить().Пользователь = Пользователь;
		КонецЕсли;
		
		РазделФорумаОбъект.Записать();	
		
	КонецЦикла;
	
	// Разделы библиотеки
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СерииПинКодовСУОРазделыБиблиотеки.РазделБиблиотеки КАК РазделБиблиотеки
		|ИЗ
		|	Справочник.СерииПинКодовСУО.РазделыБиблиотеки КАК СерииПинКодовСУОРазделыБиблиотеки
		|ГДЕ
		|	СерииПинКодовСУОРазделыБиблиотеки.Ссылка = &Серия
		|	И (СерииПинКодовСУОРазделыБиблиотеки.Опция = &Опция
		|			ИЛИ СерииПинКодовСУОРазделыБиблиотеки.Опция = ЗНАЧЕНИЕ(Справочник.ОпцииСерииПинКодовСУО.ПустаяСсылка))";
	
	Запрос.УстановитьПараметр("Серия", Серия);
	Запрос.УстановитьПараметр("Опция", Опция);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		РазделБиблиотекиОбъект = ВыборкаДетальныеЗаписи.РазделБиблиотеки.ПолучитьОбъект();
				
		Если РазделБиблиотекиОбъект.Видимость.Найти(Пользователь, "Пользователь") = Неопределено Тогда
			РазделБиблиотекиОбъект.Видимость.Добавить().Пользователь = Пользователь;
		КонецЕсли;
		
		РазделБиблиотекиОбъект.Записать();	
		
	КонецЦикла;
	
	// Новости
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СерииПинКодовСУОНовости.Новость КАК Новость
		|ИЗ
		|	Справочник.СерииПинКодовСУО.Новости КАК СерииПинКодовСУОНовости
		|ГДЕ
		|	СерииПинКодовСУОНовости.Ссылка = &Серия
		|	И (СерииПинКодовСУОНовости.Опция = &Опция
		|			ИЛИ СерииПинКодовСУОНовости.Опция = ЗНАЧЕНИЕ(Справочник.ОпцииСерииПинКодовСУО.ПустаяСсылка))";
	
	Запрос.УстановитьПараметр("Серия", Серия);
	Запрос.УстановитьПараметр("Опция", Опция);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		НовостьОбъект = ВыборкаДетальныеЗаписи.Новость.ПолучитьОбъект();
				
		Если НовостьОбъект.Получатели.Найти(Пользователь, "Пользователь") = Неопределено Тогда
			НовостьОбъект.Получатели.Добавить().Пользователь = Пользователь;
		КонецЕсли;
		
		Если НовостьОбъект.Проведен Тогда
			НовостьОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			НовостьОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
		
	КонецЦикла;

	// Зачисляем на обучение
	
	// Примечение: на обучение следует зачислять
	// в последнюю очередь, так как этот процесс может зависеть
	// от данных выше.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СерииПинКодовСУООбучение.Проведение КАК Проведение
		|ИЗ
		|	Справочник.СерииПинКодовСУО.Обучение КАК СерииПинКодовСУООбучение
		|ГДЕ
		|	СерииПинКодовСУООбучение.Ссылка = &Серия
		|	И (СерииПинКодовСУООбучение.Опция = &Опция
		|			ИЛИ СерииПинКодовСУООбучение.Опция = ЗНАЧЕНИЕ(Справочник.ОпцииСерииПинКодовСУО.ПустаяСсылка))";
	
	Запрос.УстановитьПараметр("Серия", Серия);
	Запрос.УстановитьПараметр("Опция", Опция);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ТипЗнч(ВыборкаДетальныеЗаписи.Проведение) = Тип("ДокументСсылка.ПроведениеОбученияСУО") Тогда			
			ПрохождениеОбучения = УправлениеОбучениемСУО.ЗачислитьУчастникаНаОбучение(
				ВыборкаДетальныеЗаписи.Проведение,,Пользователь,,,,Ложь,,ОбновитьДанныеВебКабинета);			
		КонецЕсли;
		
		Если ТипЗнч(ВыборкаДетальныеЗаписи.Проведение) = Тип("ДокументСсылка.ПроведениеПрограммыОбученияСУО") Тогда			
			ПрохождениеПрограммыОбучения = УправлениеОбучениемСУО.ЗачислитьУчастникаНаПрограммуОбучения(
				ВыборкаДетальныеЗаписи.Проведение, Пользователь,,,,ОбновитьДанныеВебКабинета);			
		КонецЕсли;		
		
	КонецЦикла;
	
	// Завершаем
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

Функция ВыдатьКод(Знач Серия, Знач Сообщение=Неопределено, Знач ЭлектроннаяПочта=Неопределено) Экспорт
	
	// Получаем переменные
	
	КодСерии = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Серия, "Код");
	
	// Ищем ранее выданный пин-код
	
	Если Сообщение <> Неопределено Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВыданныеПинКодыСУО.Код КАК Код
			|ИЗ
			|	РегистрСведений.ВыданныеПинКодыСУО КАК ВыданныеПинКодыСУО
			|ГДЕ
			|	ВыданныеПинКодыСУО.Серия = &Серия
			|	И ВыданныеПинКодыСУО.Сообщение = &Сообщение
			|	И ВыданныеПинКодыСУО.Выдан = ИСТИНА";
		
		Запрос.УстановитьПараметр("Серия", Серия);
		Запрос.УстановитьПараметр("Сообщение", Сообщение);
		
		РезультатЗапроса = Запрос.Выполнить();

		Если НЕ РезультатЗапроса.Пустой() Тогда
		
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			ВыборкаДетальныеЗаписи.Следующий();

			Возврат КодСерии + ВыборкаДетальныеЗаписи.Код;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭлектроннаяПочта <> Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВыданныеПинКодыСУО.Код КАК Код
			|ИЗ
			|	РегистрСведений.ВыданныеПинКодыСУО КАК ВыданныеПинКодыСУО
			|ГДЕ
			|	ВыданныеПинКодыСУО.Серия = &Серия
			|	И ВыданныеПинКодыСУО.ЭлектроннаяПочта = &ЭлектроннаяПочта
			|	И ВыданныеПинКодыСУО.Выдан = ИСТИНА";
		
		Запрос.УстановитьПараметр("Серия", Серия);
		Запрос.УстановитьПараметр("ЭлектроннаяПочта", ЭлектроннаяПочта);
		
		РезультатЗапроса = Запрос.Выполнить();

		Если НЕ РезультатЗапроса.Пустой() Тогда
		
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			ВыборкаДетальныеЗаписи.Следующий();

			Возврат КодСерии + ВыборкаДетальныеЗаписи.Код;
			
		КонецЕсли;		
		
	КонецЕсли;
	
	//Выдаем новый пин-код
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВыданныеПинКодыСУО.Код КАК Код
		|ИЗ
		|	РегистрСведений.ВыданныеПинКодыСУО КАК ВыданныеПинКодыСУО
		|ГДЕ
		|	ВыданныеПинКодыСУО.Серия = &Серия
		|	И ВыданныеПинКодыСУО.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|	И ВыданныеПинКодыСУО.Выдан = ЛОЖЬ
		|	И ВыданныеПинКодыСУО.Заблокирован = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Серия", Серия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ВызватьИсключение НСтр("ru = 'Отсутствует свободный пин-код для рассылки'");
	КонецЕсли;
	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	УстановитьСнятьОтметкуВыдан(Серия, ВыборкаДетальныеЗаписи.Код, Истина, Сообщение, ЭлектроннаяПочта);
	
	Возврат КодСерии + ВыборкаДетальныеЗаписи.Код;
	
КонецФункции

Процедура УстановитьСнятьОтметкуВыдан(Серия, Код, Выдан=Неопределено, Сообщение=Неопределено, ЭлектроннаяПочта=Неопределено) Экспорт
	
	НаборЗаписей = РегистрыСведений.ВыданныеПинКодыСУО.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Серия.Установить(Серия);
	НаборЗаписей.Отбор.Код.Установить(Код);

	НаборЗаписей.Прочитать();

	Если НаборЗаписей.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Пин-код не найден'");
	КонецЕсли;
	
	Запись = НаборЗаписей[0];	
	
	Запись.Сообщение = Неопределено;
	Запись.ЭлектроннаяПочта = Неопределено;
	
	Если Сообщение <> Неопределено Тогда
		Запись.Сообщение = Сообщение;
	КонецЕсли;
	
	Если ЭлектроннаяПочта <> Неопределено Тогда
		Запись.ЭлектроннаяПочта = ЭлектроннаяПочта;
	КонецЕсли;
	
	Если Выдан = Неопределено Тогда
		Запись.Выдан = НЕ Запись.Выдан;
	Иначе
		Запись.Выдан = Выдан;
	КонецЕсли;	
	
	Запись.ДатаВыдачи = ТекущаяДатаСеанса();
	Запись.Выдавший = Пользователи.ТекущийПользователь();
	
	НаборЗаписей.Записать();	
	
КонецПроцедуры

Процедура УстановтьСнятьОтметкуЗаблокирован(Серия, Код, Заблокирован=Неопределено) Экспорт
	
	НаборЗаписей = РегистрыСведений.ВыданныеПинКодыСУО.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Серия.Установить(Серия);
	НаборЗаписей.Отбор.Код.Установить(Код);

	НаборЗаписей.Прочитать();

	Если НаборЗаписей.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Пин-код не найден'");
	КонецЕсли;
	
	Запись = НаборЗаписей[0];	
	
	Если Заблокирован = Неопределено Тогда
		Запись.Заблокирован = НЕ Запись.Заблокирован;
	Иначе
		Запись.Заблокирован = Заблокирован;
	КонецЕсли;	
	
	Запись.Заблокировал = Пользователи.ТекущийПользователь();
	Запись.ДатаБлокировки = ТекущаяДатаСеанса();
	
	НаборЗаписей.Записать();	
	
КонецПроцедуры

Функция ПолучитьТекстУведомленияИЗапомнить(Знач Пользователь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Ищем
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыданныеПинКодыСУО.Серия.Уведомление КАК Уведомление,
		|	ВыданныеПинКодыСУО.Серия КАК Серия,
		|	ВыданныеПинКодыСУО.Код КАК Код
		|ИЗ
		|	РегистрСведений.ВыданныеПинКодыСУО КАК ВыданныеПинКодыСУО
		|ГДЕ
		|	ВыданныеПинКодыСУО.Пользователь = &Пользователь
		|	И ВыданныеПинКодыСУО.Заблокирован = ЛОЖЬ
		|	И ВыданныеПинКодыСУО.УведомлениеПоказано = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();

	// Запоминаем
	
	НаборЗаписей = РегистрыСведений.ВыданныеПинКодыСУО.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Серия.Установить(ВыборкаДетальныеЗаписи.Серия);
	НаборЗаписей.Отбор.Код.Установить(ВыборкаДетальныеЗаписи.Код);

	НаборЗаписей.Прочитать();	
	
	Если НаборЗаписей.Количество() <> 1 Тогда
		ВызватьИсключение НСтр("ru = 'Пин-код не найден'");
	КонецЕсли;
	
	Запись = НаборЗаписей[0];	
	
	Запись.УведомлениеПоказано = Истина;
	Запись.ДатаПоказаУведомления = ТекущаяДатаСеанса();
	
	НаборЗаписей.Записать();
	
	// Завершаем
	
	Возврат ВыборкаДетальныеЗаписи.Уведомление;
	
КонецФункции

// ЧТЕНИЕ

Функция КодДоступенДляАктивации(Знач ПинКод, Знач ИдентификаторОпции=Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПинКод = СтрЗаменить(ПинКод, "-", "");
	
	ДанныеПинКода = Новый Структура("Серия, Код, Опция, ДоступенДляАктивации, ТребуетсяОпция, КодОшибки, ТекстОшибки", Неопределено, Сред(ПинКод, 5), Неопределено, Ложь, Ложь, "error", "");	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СерииПинКодовСУО.Ссылка
		|ИЗ
		|	Справочник.СерииПинКодовСУО КАК СерииПинКодовСУО
		|ГДЕ
		|	СерииПинКодовСУО.Код = &КодСерии";
	
	Запрос.УстановитьПараметр("КодСерии", Сред(ПинКод, 1, 4));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ДанныеПинКода.КодОшибки = "noPinCode";
		ДанныеПинКода.ТекстОшибки = НСтр("ru = 'Пин-код не найден'");
		Возврат ДанныеПинКода;		
	КонецЕсли;			
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();			
	ВыборкаДетальныеЗаписи.Следующий();			
	
	ДанныеПинКода.Серия = ВыборкаДетальныеЗаписи.Ссылка;
	ДанныеПинКода.Опция = Справочники.СерииПинКодовСУО.НайтиОпциюПоИдентификатору(ИдентификаторОпции);
	
	Если НЕ ЗначениеЗаполнено(ДанныеПинКода.Опция)
		И Справочники.СерииПинКодовСУО.ЕстьОпции(ДанныеПинКода.Серия) Тогда
		
		ДанныеПинКода.КодОшибки = ""; // Это не ошибка, но и активировать нельзя
		ДанныеПинКода.ТребуетсяОпция = Истина;
		Возврат ДанныеПинКода;		
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыданныеПинКодыСУО.ДатаИспользования КАК ДатаИспользования,
		|	ВыданныеПинКодыСУО.Заблокирован КАК Заблокирован
		|ИЗ
		|	РегистрСведений.ВыданныеПинКодыСУО КАК ВыданныеПинКодыСУО
		|ГДЕ
		|	ВыданныеПинКодыСУО.Серия = &Серия
		|	И ВыданныеПинКодыСУО.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", ДанныеПинКода.Код);
	Запрос.УстановитьПараметр("Серия", ДанныеПинКода.Серия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ДанныеПинКода.КодОшибки = "noPinCode";
		ДанныеПинКода.ТекстОшибки = НСтр("ru = 'Пин-код не найден'");
		Возврат ДанныеПинКода;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Если ВыборкаДетальныеЗаписи.Заблокирован Тогда
		ДанныеПинКода.КодОшибки = "disabledPinCode";
		ДанныеПинКода.ТекстОшибки = НСтр("ru = 'Пин-код заблокирован'");
		Возврат ДанныеПинКода;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаИспользования) Тогда
		ДанныеПинКода.КодОшибки = "usedPinCode";
		ДанныеПинКода.ТекстОшибки = НСтр("ru = 'Пин-код использован ранее'");
		Возврат ДанныеПинКода;
	КонецЕсли;	
	
	ДанныеПинКода.ДоступенДляАктивации = Истина;
	ДанныеПинКода.КодОшибки = "";
	ДанныеПинКода.ТекстОшибки = "";
	
	Возврат ДанныеПинКода;
	
КонецФункции

Функция КодыПользователя(Знач Пользователь) Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыданныеПинКодыСУО.Серия.Описание КАК Описание,
		|	ВыданныеПинКодыСУО.Серия.Код + ВыданныеПинКодыСУО.Код КАК ПинКод,
		|	ВыданныеПинКодыСУО.ДатаИспользования КАК ДатаИспользования,
		|	ВыданныеПинКодыСУО.Опция.Наименование КАК НаименованиеОпции
		|ИЗ
		|	РегистрСведений.ВыданныеПинКодыСУО КАК ВыданныеПинКодыСУО
		|ГДЕ
		|	ВыданныеПинКодыСУО.Заблокирован = ЛОЖЬ
		|	И ВыданныеПинКодыСУО.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция НовыйУникальныйКод(Длина, Вид, МассивКодов, КоличествоИтераций=Неопределено, Генератор)
	
	Если КоличествоИтераций = Неопределено Тогда		
		КоличествоИтераций = 0;		
	Иначе		
		КоличествоИтераций = КоличествоИтераций + 1;		
	КонецЕсли;
	
	Если КоличествоИтераций > 10 Тогда
		ВызватьИсключение НСтр("ru = 'Генератор не может сгенерировать новый уникальный код в данной серии. Создайте новую серию пин-кодов'");
	КонецЕсли;
	
	Код = НовыйКод(Длина, Вид, Генератор);
	
	Если МассивКодов.Найти(Код) = Неопределено Тогда
		Возврат Код;		
	Иначе
		Возврат НовыйУникальныйКод(Длина, Вид, МассивКодов, КоличествоИтераций, Генератор); // Рекурсия
	КонецЕсли;
	
КонецФункции

Функция НовыйКод(Длина, Вид, Генератор)
	
	ЗаглавныеБуквы = "QWERTYUOPASDFGHJKLZXCVBNM"; // Без буквы I
	КоличествоЗаглавныхБукв = СтрДлина(ЗаглавныеБуквы);
	
	Цифры = "1234567890";
	КоличествоЦифр = СтрДлина(Цифры);
	
	НовыйКод = "";
	
	Пока СтрДлина(НовыйКод) < Длина Цикл
		
		Число = Генератор.СлучайноеЧисло(1, 3);
		
		Если (Число = 1 Или Число = 2) И Вид = Перечисления.ВидыПинКодовСУО.ЦифрыИАнглийскиеБуквы Тогда
			
			Индекс = Генератор.СлучайноеЧисло(1, КоличествоЗаглавныхБукв);
			НовыйКод = НовыйКод + Сред(ЗаглавныеБуквы, Индекс, 1);
			
		Иначе
			
			Индекс = Генератор.СлучайноеЧисло(1, КоличествоЦифр);
			НовыйКод = НовыйКод + Сред(Цифры, Индекс, 1);
			
		КонецЕсли;
		
	КонецЦикла;

	Возврат НовыйКод;
	
КонецФункции

#КонецОбласти

#КонецЕсли
